Walls overlap. Consider embedding walls, editing their extents or profile to avoid overlapping.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId WallsOverlap { get; }
  Visual Basic
Public Shared ReadOnly Property WallsOverlap As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ WallsOverlap {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures PerformanceFailures Class
  Autodesk.Revit.DB Namespace